#+TITLE:  Brandon's Emacs Init
#+AUTHOR: Brandon Guttersohn
#+EMAIL:  bguttersohn@gmail.com

This is my emacs init file, written in org-babel.

** Tweaks

DISABLED: Use fuzzy matching in ivy

#+BEGIN_SRC
(setq ivy-re-builders-alist
      '((t . ivy--regex-fuzzy)))
#+END_SRC

Allow file management in counsel's file-find

#+BEGIN_SRC emacs-lisp
;; https://github.com/abo-abo/swiper/wiki/Copy,-move-and-delete-file-actions-for-counsel-find-file
(defun reloading (cmd)
    (lambda (x)
      (funcall cmd x)
      (ivy--reset-state ivy-last)))
  (defun given-file (cmd prompt) ; needs lexical-binding
    (lambda (source)
      (let ((target
      (let ((enable-recursive-minibuffers t))
      (read-file-name
      (format "%s %s to:" prompt source)))))
      (funcall cmd source target 1))))
(defun confirm-delete-file (x)
    (dired-delete-file x 'confirm-each-subdirectory))

  (ivy-add-actions
   'counsel-find-file
   `(("c" ,(given-file #'copy-file "Copy") "copy")
     ("d" ,(reloading #'confirm-delete-file) "delete")
     ("m" ,(reloading (given-file #'rename-file "Move")) "move")))
  (ivy-add-actions
   'counsel-projectile-find-file
   `(("c" ,(given-file #'copy-file "Copy") "copy")
     ("d" ,(reloading #'confirm-delete-file) "delete")
     ("m" ,(reloading (given-file #'rename-file "Move")) "move")
     ("b" counsel-find-file-cd-bookmark-action "cd bookmark")))
#+END_SRC

#+RESULTS:
: .*\*helm.*\|.*\*Minibuf-.*

Show current/total matches in isearch

#+BEGIN_SRC emacs-lisp
(global-anzu-mode +1)
#+END_SRC

Show whitespace

#+BEGIN_SRC emacs-lisp
(global-whitespace-mode 0)
(setq whitespace-style '(face trailing))
#+END_SRC

Use visual bell instead of audible.

#+BEGIN_SRC emacs-lisp
;; nice little alternative visual bell; Miles Bader <miles /at/ gnu.org>
(defcustom echo-area-bell-string "*DING* "
  "Message displayed in mode-line by `echo-area-bell' function."
  :group 'user)

(defcustom echo-area-bell-delay 0.1
  "Number of seconds `echo-area-bell' displays its message."
  :group 'user)
;; internal variables

(defvar echo-area-bell-cached-string nil)

(defvar echo-area-bell-propertized-string nil)

(defun echo-area-bell ()
  "Briefly display a highlighted message in the echo-area.
    The string displayed is the value of `echo-area-bell-string',
    with a red background; the background highlighting extends to the
    right margin.  The string is displayed for `echo-area-bell-delay'
    seconds.
    This function is intended to be used as a value of `ring-bell-function'."
  (unless (memq this-command '(keyboard-quit keyboard-escape-quit))
    (unless (equal echo-area-bell-string echo-area-bell-cached-string)
      (setq echo-area-bell-propertized-string
            (propertize
             (concat
              (propertize
               "x"
               'display
               `(space :align-to (- right ,(+ 2 (length echo-area-bell-string)))))
              echo-area-bell-string)
             'face '(:background "red" :foreground "white" :weight bold)))
      (setq echo-area-bell-cached-string echo-area-bell-string))
    (message echo-area-bell-propertized-string)
    (sit-for echo-area-bell-delay)
    (message "")))
(setq ring-bell-function 'echo-area-bell)
#+END_SRC

Get rid of blinking cursor

#+BEGIN_SRC emacs-lisp
(setq default-cursor-type 'box)
(blink-cursor-mode -1)
#+END_SRC

Display trailing whitespace

#+BEGIN_SRC emacs-lisp
(setq-default show-trailing-whitespace t)
#+END_SRC

Highlight body of parens

#+BEGIN_SRC emacs-lisp
(setq show-paren-style 'expression)
(show-paren-mode 1)
#+END_SRC

Use a consistent window name. This helps with AutoHotkey recognition on Windows, in addition to being a little more usable in Linux.

#+BEGIN_SRC emacs-lisp
(setq frame-title-format "emacs")
#+END_SRC

Make sure we push any kill-ring data into OS clipboard.

#+BEGIN_SRC emacs-lisp
(setq save-interprogram-paste-before-kill t)
#+END_SRC

Highlight the current line

#+BEGIN_SRC emacs-lisp
(global-hl-line-mode)
#+END_SRC

When buffer is not modified in emacs, automatically reload it when its file changes on disk.

#+BEGIN_SRC emacs-lisp
(global-auto-revert-mode)
#+END_SRC

Tweak the text shown when hiding regions of a buffer.

#+BEGIN_SRC emacs-lisp
(setq hide-region-before-string "hidden-region-->")
(setq hide-region-after-string "<--hidden-region")
#+END_SRC

Make sure that diff-hl-mode is showing changes between now and the last commit, only.

#+BEGIN_SRC emacs-lisp
(global-diff-hl-amend-mode 1)
#+END_SRC

Fall back to frame-moving if window-moving doesn't cut it.

#+BEGIN_SRC emacs-lisp
(setq framemove-hook-into-windmove t)
#+END_SRC

Remove flashy splash stuff

#+BEGIN_SRC emacs-lisp
(setq inhibit-splash-screen t)
(setq inhibit-startup-echo-area-message t)
(setq inhibit-startup-screen t)
(setq inhibit-startup-message t)
#+END_SRC

Show prefix keys in the echo area much faster.

#+BEGIN_SRC emacs-lisp
(setq echo-keystrokes 0.001)
#+END_SRC

Tabs are not okay.

#+BEGIN_SRC emacs-lisp
(add-hook 'font-lock-mode-hook
  (lambda ()
    (font-lock-add-keywords
      nil
      '(("\t" 0 'trailing-whitespace prepend)))))
#+END_SRC

Highlight some common tags.

#+BEGIN_SRC emacs-lisp
(font-lock-add-keywords nil
  '(("\\<\\(DEBUG\\)" 1 font-lock-warning-face prepend)
    ("\\<\\(FIXME\\)" 1 font-lock-warning-face prepend)
    ("\\<\\(TODO\\)"  1 font-lock-warning-face prepend)
    ("\\<\\(JIRA\\)"  1 font-lock-warning-face prepend)))
#+END_SRC

Clear the minibuffer.

#+BEGIN_SRC emacs-lisp
(delete-minibuffer-contents)
#+END_SRC

** Keys

#+BEGIN_SRC emacs-lisp

(general-auto-unbind-keys)

(setq my:shortcut-leader "<f12>")
(general-define-key :prefix my:shortcut-leader

    ;; Double tap
    my:shortcut-leader 'org-capture

    ;; "o"-> Org global shortcuts
    "od"               'my:org-journal-open-today
    "oa"               'org-agenda
    "ot"               'org-todo-list
    "oc"               'my:org-concept-open

    ;; "m"-> Magit global shortcuts
    "ms"               'magit-status
    "mb"               'magit-blame
    "md"               'magit-diff

    ;; language modes
    "lm"               'markdown-mode
    "lp"               'python-mode
    "le"               'emacs-lisp-mode
    "lc"               'c-mode
    "lo"               'org-mode

    ;; external tools
    "g"                'my:google
    "x"                'my:run-program)

(general-define-key

    ;; Controlling emacs
    "M-x"        'counsel-M-x
    "<escape>"   'execute-command-toggle
    "S-<escape>" 'execute-command-toggle-ignore-region

    ;; Window navigation
    "H-<right>" 'windmove-right
    "H-<left>"  'windmove-left
    "H-<down>"  'windmove-down
    "H-<up>"    'windmove-up
    "<S-f8>"    'delete-window-ex
    "<H-f8>"    'kill-current-buffer
    "<f8>"      'delete-window-ex

    ;; Workspaces (virtual desktops/saved window configs/etc)
    "H-0"       'eyebrowse-switch-to-window-config-0
    "H-1"       'eyebrowse-switch-to-window-config-1
    "H-2"       'eyebrowse-switch-to-window-config-2
    "H-3"       'eyebrowse-switch-to-window-config-3
    "H-4"       'eyebrowse-switch-to-window-config-4
    "H-5"       'eyebrowse-switch-to-window-config-5
    "H-6"       'eyebrowse-switch-to-window-config-6
    "H-7"       'eyebrowse-switch-to-window-config-7
    "H-8"       'eyebrowse-switch-to-window-config-8
    "H-9"       'eyebrowse-switch-to-window-config-9

    ;; Window splitting
    ; names seem wrong, but I imagine dpad right to mean "send focus right", etc.
    "H-s <left>"  'split-window-right
    "H-s <right>" 'split-window-left
    "H-s <down>"  'split-window-above
    "H-s <up>"    'split-window-below

    ; Window resizing
    "H-S-<up>"      'enlarge-window
    "H-S-<right>"   'enlarge-window-horizontally
    "H-S-<down>"    'shrink-window
    "H-S-<left>"    'shrink-window-horizontally

    ;; Frame manipulations
    "<H-f11>"   'toggle-frame-fullscreen
    "H-t"       'my:set-window-opacity

    ;; Keyboard macros
    "H-*"        'kmacro-start-macro
    "<f1>"       (lambda () (interactive) (my:run-or-save-macro "f1"))
    "<f2>"       (lambda () (interactive) (my:run-or-save-macro "f2"))
    "<f3>"       (lambda () (interactive) (my:run-or-save-macro "f3"))
    "<f4>"       (lambda () (interactive) (my:run-or-save-macro "f4"))
    "C-<f1>"     (lambda () (interactive) (my:run-macro "f1"))
    "C-<f2>"     (lambda () (interactive) (my:run-macro "f2"))
    "C-<f3>"     (lambda () (interactive) (my:run-macro "f3"))
    "C-<f4>"     (lambda () (interactive) (my:run-macro "f4"))

    ;; File operations
    "<f5>"   'my:find-file
    "<f6>"   'custom-save-buffer
    "<f7>"   'write-file

    ;; OS Utilities
    "H-f"  'rgrep
    "<f9>" 'shell

    ;; Text navigation
    "<home>"   'smart-beginning-of-line
    "M-<up>"   'backward-paragraph
    "M-<down>" 'forward-paragraph
    "H-o"      'my:occur
    "H-a"      'my:find-text
    "H-A"      'my:find-this-text
    "H-["      'my:goto-previous-change
    "H-]"      'my:goto-next-change
    "H-g"      'my:goto-line
    "H-p"      'isearch-forward-regexp
    "H-k"      'next-line
    "H-i"      'previous-line
    "H-j"      'left-char
    "H-l"      'right-char
    "H-h"      'smart-beginning-of-line

    ;; Text selection and editing
    "C-<delete>"   'smart-batch-delete
    "<insert>"     'smart-copy-paste
    "<delete>"     'smart-cut-or-delete
    "C-SPC"        'smart-set-mark
    "H-r"          'anzu-query-replace-regexp
    "H-y"          'yas-insert-snippet
    "C-<return>"   'newline-after-current
    "M-<return>"   'newline-before-current
    "C-M-<return>" 'newline-before-and-after-current
    "C-t"          'indent-according-to-mode
    "C-z"          'undo-tree-undo
    "C-S-z"        'undo-tree-redo
    "H-z"          'undo-tree-visualize
    "C-c a"        'mark-whole-buffer

    ;; Bookmarks
    "H-SPC"                   'bm-toggle
    "H-S-SPC"                 'my:annotated-bookmark
    "H-}"                     'bm-next
    "H-{"                     'bm-previous
    "<left-margin> <mouse-1>" 'bm-toggle-mouse

    ;; Text display transformations
    "H-h" 'origami-toggle-node

    ;; Buffer navigation
    "H-b"         'my:find-buffer
    "<prior>"     'previous-appropriate-buffer
    "<next>"      'next-appropriate-buffer
    "C-H-<left>"  'buf-move-left
    "C-H-<right>" 'buf-move-right
    "C-H-<up>"    'buf-move-up
    "C-H-<down>"  'buf-move-down
    "C-<up>"      'my:scroll-down-some-lines
    "C-<down>"    'my:scroll-up-some-lines
    "C-<left>"    'my:scroll-left-some-lines
    "C-<right>"   'my:scroll-right-some-lines
    "H-u"         'line-to-top-of-window

    ;; Other
    "H-=" '(lambda () (interactive) (text-scale-increase 1))
    "H--" '(lambda () (interactive) (text-scale-decrease 1)))

(general-define-key :keymaps 'isearch-mode-map
    "<backspace>" 'isearch-del-char
    "<escape>"    'isearch-exit
    "<C-escape>"  'isearch-abort
    "<return>"    'isearch-repeat-forward
    "S-<return>"  'isearch-repeat-backward
    "<right>"     'isearch-yank-word-or-char
    "<left>"      'isearch-del-char
    "<down>"      'isearch-repeat-forward
    "<up>"        'isearch-repeat-backward)

(general-define-key :keymaps 'query-replace-map
    "<up>"     'backup
    "<down>"   'skip
    "<escape>" 'exit
    "<return>" 'act
    "<insert>" 'edit)

(general-define-key :keymaps 'c-mode-map
    "<tab>" 'c-smart-tab-key
    "TAB"   'c-smart-tab-key
    "C-t"   'c-indent-line-or-region
    "C-r"   'align-current)

(general-define-key :keymaps 'c-mode-map :prefix "H-c"
    "1" 'c-insert-region-heading
    "2" 'c-insert-function-skeleton
    "3" 'c-insert-forced-todo
    "4" 'c-insert-debugging-printf
    "5" 'c-insert-ternary-for-boolean-to-string
    "6" 'c-insert-todo-comment
    "f" 'c-insert-if-block
    "o" 'c-insert-for-block
    "w" 'c-insert-while-block
    "d" 'c-insert-do-while-block
    "F" 'c-insert-preproc-if-block
    "D" 'c-insert-preproc-ifdef-block
    "N" 'c-insert-preproc-ifndef-block
    "I" 'c-insert-preproc-include-block)

(general-define-key :keymaps 'prog-mode-map
    "H-;" 'my:comment-region-or-line)

(general-define-key :keymaps 'shell-mode-map
    "C-p"   'comint-previous-input
    "C-n"   'comint-next-input
    "C-M-l" nil)

(general-define-key :keymaps 'flyspell-mode-map
    "H-c" 'flyspell-auto-correct-word)

(customize-set-variable 'exwm-input-global-keys
    `((,(kbd "H-<left>") .    windmove-left)
      (,(kbd "H-s <up>") .    split-window-below)
      (,(kbd "H-<right>") .   windmove-right)
      (,(kbd "H-<down>") .    windmove-down)
      (,(kbd "H-<up>") .      windmove-up)
      (,(kbd "<H-f8>") .      kill-current-buffer)
      (,(kbd "S-<F8>") .      delete-window-ex)
      (,(kbd "S-<F8>") .      delete-window-ex)
      (,(kbd "H-b") .         my:find-buffer)
      (,(kbd "H-S-<up>") .    (lambda () (interactive) (enlarge-window 5)))
      (,(kbd "H-S-<right>") . enlarge-window-horizontally)
      (,(kbd "H-S-<down>") .  (lambda () (interactive) (shrink-window 5)))
      (,(kbd "H-S-<left>") .  shrink-window-horizontally)
      (,(kbd "H-s <down>") .  split-window-above)
      (,(kbd "H-s <left>") .  split-window-right)
      (,(kbd "H-s <right>") . split-window-left)
      (,(kbd "H-c") .         exwm-input-release-keyboard)
      (,(kbd "H-l") .         exwm-input-grab-keyboard)
      (,(kbd "H-e") .         exwm-edit--compose)
      (,(kbd "H-0") .         eyebrowse-switch-to-window-config-0)
      (,(kbd "H-1") .         eyebrowse-switch-to-window-config-1)
      (,(kbd "H-2") .         eyebrowse-switch-to-window-config-2)
      (,(kbd "H-3") .         eyebrowse-switch-to-window-config-3)
      (,(kbd "H-4") .         eyebrowse-switch-to-window-config-4)
      (,(kbd "H-5") .         eyebrowse-switch-to-window-config-5)
      (,(kbd "H-6") .         eyebrowse-switch-to-window-config-6)
      (,(kbd "H-7") .         eyebrowse-switch-to-window-config-7)
      (,(kbd "H-8") .         eyebrowse-switch-to-window-config-8)
      (,(kbd "H-9") .         eyebrowse-switch-to-window-config-9)
      (,(kbd "C-M-<left>") .  eyebrowse-prev-window-config)
      (,(kbd "C-M-<right>") . eyebrowse-next-window-config)))

(customize-set-variable 'exwm-input-simulation-keys
    `((,(kbd "H-a") .        ,(kbd "C-f"))
      (,(kbd "<insert>") .   ,(kbd "C-c"))
      (,(kbd "S-<insert>") . ,(kbd "C-v"))))
#+END_SRC

#+RESULTS:
: (([16777313] . ) ([insert] . ) ([S-insert] . ))

Dead block -- can be used to generate keys for workspace switching.
I'm just using window layouts instead.

#+BEGIN_SRC
,@(mapcar (lambda (i)
        `(,(kbd (format "H-%d" i)) .
          (lambda ()
              (interactive)
              (exwm-workspace-switch-create ,i))))
              (number-sequence 0 9)))
#+END_SRC

